chenshuang888/esp32-p4-demo1/sdkconfig.defaults
# Waveshare ESP32-P4-WIFI6-Touch-LCD-7B 板级默认配置
# 参考: esp32p4_research/ESP32-P4-WIFI6-Touch-LCD-7B/examples/ESP-IDF/*/sdkconfig.defaults
#
# 注意: 厂家示例是用 ESP-IDF 5.4.0 生成的; 本项目使用 ESP-IDF 5.4.3。
#       5.4.3 中 200MHz PSRAM 依赖 IDF_EXPERIMENTAL_FEATURES，故一并打开。

CONFIG_IDF_TARGET="esp32p4"

# ---- Flash ----
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y

# ---- PSRAM ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# ---- Cache ----
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# ---- 分区表 (自定义, 见同目录 partitions.csv) ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- IDF 5.4.3: 200MHz PSRAM 需要打开实验特性才可见 ----
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# ---- LVGL ----
# LVGL 默认 LV_USE_OS = NONE（无线程安全），必须选 FreeRTOS
# LVGL 相关：main 任务里会创建界面对象，栈给足；提高 tick 精度改善刷新/动画
CONFIG_LV_OS_FREERTOS=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000

# 内存/字符串/格式化统一走 C 库（即 ESP-IDF 的堆），厂家 LVGL 示例同样配置
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15

# 全局默认字体。全项目代码里一处都没设过字体（都用继承），所以所有文字
# 吃的都是这一项 —— 改这里 = 全项目字号一起变。
# 18 号字体由这个 choice 自动 select 进来（Kconfig 里的 select LV_FONT_MONTSERRAT_18）。
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_18=y

# ---- USB Host（USB 摄像头 / UVC 需要）----
# 这两项是 UVC 能不能工作的**前提**，不是调优项：
#
# 1) 默认 256 太小。IDF 在 components/usb/Kconfig 里写明
#    "Device's with configuration descriptors larger than this limit cannot be supported"
#    —— UVC 设备的配置描述符（VC + VS 接口 + 格式 + 帧描述符）远超 256 字节，
#    256 会让摄像头**根本枚举不出来**。
# 2) 视频流是 IN 方向。Balanced 的 IN FIFO 只有 408 字节，Bias IN 给到 600
#    （代价是 OUT non-periodic 降到 64 字节，我们用不到 OUT）。
#
# 取值来自 demo1 的 USB 摄像头工程（同一块板实测可用）。
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=4096
CONFIG_USB_HOST_HW_BUFFER_BIAS_IN=y

# ---- WiFi（板载 ESP32-C6 协处理器，P4 <-> C6 走 SDIO）----
#
# 取值出处：厂家 brookesia 手机示例的**生成版** sdkconfig
#   esp32p4_research/ESP32-P4-WIFI6-Touch-LCD-7B/examples/ESP-IDF/11_esp_brookesia_phone/sdkconfig:2634-2667 (hosted)
#                                                                    :2773-2800 (wifi_remote)
# 那份 sdkconfig 里同一组配置出现了两次，**前缀不同**：
#   带 ESP_HOSTED_ 前缀的 = 正式符号名（"ESP-Hosted config" 段）
#   不带的（CONFIG_SDIO_*、CONFIG_IDF_SLAVE_TARGET） = 旧名，在 "# End of deprecated options" 段里，不要用
#
# ⚠️ 厂家**没有任何示例**在 sdkconfig.defaults 里写这些 —— 说明 esp_hosted 对
#    ESP32-P4 的默认值本来就是这套接线（和 Espressif P4-Function-EV-Board 一致）。
#    这里显式写出来的目的，是让板级接线在仓库里可见，而不是藏在第三方组件的 Kconfig 默认值里。
#    （万一某个名字写错了，kconfig 会静默忽略该行 -> 退回默认值，不会比不写更差。）
#
# ⚠️ 首次编译后请核对一次（这条链路是"配置错了不报错、只是连不上"的类型）：
#      grep -E "ESP_HOSTED_SDIO_PIN_CLK|ESP_WIFI_REMOTE_ENABLED|SLAVE_IDF_TARGET" sdkconfig
#    期望看到 PIN_CLK=18、REMOTE_ENABLED=y、SLAVE_IDF_TARGET_ESP32C6=y。
#    若没生效：删掉 sdkconfig 重新生成（defaults 只对 sdkconfig 里**尚未出现**的符号生效）。

# --- esp_wifi_remote 总开关：不写这三项，组件装了也不生效 ---
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# --- esp_hosted 传输方式：SDIO（P4 的 SDMMC slot 1，走 GPIO 矩阵）---
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y

# --- 接线（注意和 uSD 卡完全不重叠：卡在 slot0 的 IOMUX 39~44 + LDO4）---
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=18
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=19
CONFIG_ESP_HOSTED_SDIO_PIN_D0=14
CONFIG_ESP_HOSTED_SDIO_PIN_D1=15
CONFIG_ESP_HOSTED_SDIO_PIN_D2=16
CONFIG_ESP_HOSTED_SDIO_PIN_D3=17
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=54
